#coding=utf-8

"""
# 1.输出和输入
print("你好")
print("dghwi")
print(567)

# 2.输入
input("请输入你的密码")
"""
# 3.变量：
# 定义：用来存储数据的    格式：变量名=值
# 4.变量的数据类型：5
# 整型：不带小数点的数值
a = 123
print(a)

# 浮点型
a2 = 66.8
print(a2)

# 字符串:单引号或着双引号括住的
a3 = '就是丢'
a4 = "会"
print(a3,a4)
# print(a4)

# 元组： (整型,浮点型,字符串)  =====tuple
a5 = (11,3,556.7,"会")
# 查看变量的类型：type()
print(a5,type(a5))

# 列表：[整型,浮点型,字符串]=====list
a6 = ["hdwi",99,9.4,994,7,8,9]
print(a6,type(a6))
# 切片：截取某一部分   ====写法：变量名[起始位置:结束位置]===注意：不包含结束位置
print(a6[0:2])
print(a6[:4])
print(a6[3:])
print(a6[:])
print(a6[::3])
# 给负值，从右往左截取
print(a6[::-2])

# 字典:{键(key)1:值(value)1,键2：值2....}  =====dict
# 定义字典的注意事项：1.键不能重复
a7 = {
	"name":"老王",
	"sex":"男",
	"name":"python"
}
print(a7,type(a7))


